data/perf/stageB-d3bf9f8c39fe/memcached-10k/tsan/run1/memtier.txt
10        Threads
50        Connections per thread
10000     Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       188324.85          ---          ---         3.93411         3.66300        10.36700        13.69500     12849.11 
Gets      1881179.02         0.00   1881179.02         3.86251         3.59900        10.17500        13.56700     47560.80 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2069503.87         0.00   1881179.02         3.86902         3.59900        10.17500        13.56700     60409.91 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       184066.25          ---          ---         4.01716         3.77500        11.00700        15.10300     12558.56 
Gets      1838639.84         0.00   1838639.84         3.93734         3.69500        10.68700        14.84700     46485.30 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2022706.09         0.00   1838639.84         3.94460         3.71100        10.68700        14.84700     59043.86 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       185602.39          ---          ---         3.98896         3.72700        10.43100        14.27100     12663.36 
Gets      1853984.33         0.00   1853984.33         3.91390         3.66300        10.17500        14.07900     46873.25 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2039586.72         0.00   1853984.33         3.92073         3.66300        10.23900        14.07900     59536.61